{
  "Name": "Alfonso Maldonado Sibaja",
  "Profile": "Accomplished IT Project Manager with over 12 years of\nspecialized experience in leading the end-to-end implementation of\nManufacturing Execution Systems (MES), particularly PSI Metals,\nwithin the steel pipe manufacturing sector across the USA, Canada\nand Mexico. Managing the complete project lifecycle, including\nscope definition, planning, budget, design, execution, go-live and\npost-implementation support. Experience coordinating cross-\nfunctional teams and engaging stakeholders to achieve projects\non time and within budget. Brings robust functional and technical\nexpertise to drive operational enhancements and ensure the\nexecution of projects.\n\n\nSummary\n• 24+ years of experience in the Steel Manufacturing Industry.\n• 12+ years of experience in MES Implementation (PSI Metals\nExpertise).\n• Definition of MES solution that has been deployed at 7\nmanufacturing plants at USA and Canada.\n• Project Management Lifecycle (Agile and Waterfall methodologies).\n• Leadership, mentoring and development of cross-functional teams.\n• Change Management.\n• Stakeholder Engagement and Communication.\n• Impact Analysis.\n• Budget Management and Cost Control.\n• Process Improvement.\n• Very good experience of Product Feasibility, and Order Dressing.\n• Extensive experience in Order Management, Material\nManagement, Yard Management, Production Planning, Plant floor\nExecution.\n• Extensive experience defining and implementing integration models\nwith Automation systems.\n• Extensive experience in Quality Management.\n• Extensive experience of MES integration with SAP, Production\nPlanning and Management control systems.\nPage 1 of 5\nFunctional and Technical Skills:\n• PSI Metals\n• Scrum foundation\n• PL/SQL Dev\n• Oracle\n• SOAP UI\n• Power BI\n• Azure Devops\n• JIRA\n• Solman – Solution Manager\n• USD – Service desk manager\n• MS Teams, Office, Visio, MS Project\n• Natural Adabas",
  "Experience": "Lincoln Electric\nManufacturing Execution System Service Owner\noctubre de 2024 - Present (5 meses)\nCleveland, Ohio, United States\n\n\nTenaris\nTenaris Koppel - IT Project Manager\nmayo de 2023 - junio de 2024 (1 año 2 meses)\nUnited States\n\nServing as an IT Project Manager for a global leading steel pipe\nmanufacturer, I was responsible for complex and high-profile MES (PSI\nMetals) implementation across two manufacturing sites: Tenaris Koppel in\nPennsylvania and Tenaris Brookfield in Ohio. This strategic initiative promoted\nlogistical integration with Tenaris Ambridge in Pennsylvania and unified these\nthree manufacturing plants within a single MES instance. This project achieved\noperational synergy and enhanced collaborative efficiency across the north\nUSA facilities.\n\n\nResponsibilities\n• Managed the full project lifecycle including designing, planning, specification,\ntracking, testing, training, Go-Live, post-implementation support, and project\ncompletion.\n• Assessment to identify the gaps to cover all operative scenarios.\nPage 2 of 5\n• Defined the business scenarios, based on physical production lines layout\nand material flows.\n• Coordinated and developed the cross-functional project team.\n• Defined the integration model for Heat Treatment and Finishing production\nlines with Automation team.\n• Coordinated and led the workshops and meetings to validate solution of each\ngap with stakeholders.\n• Worked collaboratively with multiple functional teams, such as Automation,\nSAP, Production Planning, and Management control.\n• Defined the deliverables for each sprint with the Development team.\n• Led on all day-to-day task execution.\n• Developed and implemented project metrics and managed progress\nreporting.\n• Provided regular project updates to stakeholders.\n• Impact analysis by job position to identify the most impacted users to define\nstrategies to simplify system adoption.\n• Purchase requisition of required devices such as thin clients, thermal printers,\nscanners, etc.\n• Orchestrated comprehensive training programs for over 168 end-users,\nsignificantly enhancing system adoption.\n• Elaborated the Go-Live strategy and validated with stakeholders\n• Lead the cross-functional teams for Go-Live, and Post-Implementation on-\nsite\n\n\nTenarisTamsa\n23 años 11 meses\n\nIT Project Manager\nenero de 2022 - mayo de 2023 (1 año 5 meses)\nWorking as an IT Project Manager for a globally steel pipe manufacturer, I\nled the coordination of a cross-functional team to implement the MES (PSI\nMetals).\n\n\nResponsibilities\nLed and development the functional team to implement MES on different\nTenaris plants in USA and Canada.\nCoordinated the workshops and meetings to validate specifications and define\npriorities with stakeholders.\n\n\n\n2021 - 2022, Implementation of MES at Tenaris Algoma, Ontario, Canada,\ncovering the Bars Cutting, Hot Rolling Mill, Heat Treatment, Finishing,\nPremium Threading production lines.\n\nIT Project Leader\ndiciembre de 2011 - diciembre de 2021 (10 años 1 mes)\nWorking as an IT Project Leader for a globally steel pipe manufacturer,\nI defined the MES that has been extended to the north America region,\nthe model was defined in collaboration with a group of MES experts from\ndifferent countries, I led and developed the cross-functional team in charge to\nimplement MES (PSI Metals) on different locations in North America, I was the\nmentor of the support team in charge to support operations of Tenaris plants in\nUSA and Canada, and attend evolutive and corrective changes.\n\n\n2021, Implementation of MES (using PSI Metals) at Tenaris's Ambridge facility\nin Pennsylvania, focusing on the Hot Rolling Mill production line. The project\ninvolved a deep analysis of production workflows, customization of MES\nsoftware to fit unique operational needs, and a targeted approach to enhance\nprocess efficiency and data integrity.\n\n\n2021, Implementation of MES (using PSI Metals) at Tenaris's Koppel facility in\nPennsylvania, covering the Steel shop, and Bars Cutting production lines.\n\n\n2018, Implementation of MES (using PSI Metals) at Tenaris's Conroe facility\nin Texas, covering the Heat Treatment, Finishing, and Threading production\nlines.\n\n\n2016 - 2018, Implementation of MES (using PSI Metals) at Tenaris's Bay City\nfacility in Texas, covering the Bars Cutting, Hot Rolling Mill, Heat Treatment,\nand Finishing production lines.\n\n\n2012 - 2014, Designed of the Manufacturing Execution System (MES) using\nPSI Metals for Tenaris's US manufacturing plants, and the implementation of\nMES at Tenaris's Conroe facility in Texas, covering the Slitter, Welder, Heat\nTreatment, and Finishing production lines. This model had been extended and\nimplemented across 7 Tenaris plants located at USA and Canada.\n\nIT Application Responsable\nabril de 2005 - noviembre de 2011 (6 años 8 meses)\nResponsibilities\nLed and development the functional and development teams\nPage 4 of 5\n2010 - Implementation of MES at Tenaris Tamsa, Veracruz, México, covering\nthe Bars Cutting, Hot Rolling Mill, Heat Treatment, and Finishing production\nlines.\n\n\n2008 - Implementation of MES at Tenaris Tamsa, Veracruz, México, covering\nthe Premium Threading production lines.\n\n\nSupport plant operations, implementation of evolutive and corrective changes\nto different business process and manufacturing plants at Tenaris Tamsa.\n\nIT Analyst & Developer\njulio de 1999 - marzo de 2005 (5 años 9 meses)\nResposibilities\nAnalysis, Development, Testing and Implementation of evolutive, and\ncorrective changes on MES to different business process such as Supply\nchain, Product feasibility, Order Management, Production planning, and Plant\nfloor execution.",
  "Education": [
    {
      "Institution": "Universidad Cristóbal Colón, Veracruz, Mexico",
      "Start": "2005",
      "End": "2007",
      "Degree": "Master's degree, Information Technology"
    },
    {
      "Institution": "Instituto Tecnologico de Veracruz, Veracruz, Mexico",
      "Start": "1994",
      "End": "1999",
      "Degree": "Bachelor's degree, Computer Engineering"
    }
  ],
  "Contact": [
    "alfmalsib@gmail.com",
    "www.linkedin.com/in/alfonso-maldonado-s (LinkedIn)"
  ],
  "Top Skills": [
    "Planeamiento de proyectos",
    "Análisis de negocio",
    "Gestión de proyectos"
  ]
}