{
  "Name": "Victor Alvarez Gil",
  "Profile": "Soy una persona honesta, responsable, respetuosa y amigable,\n\nposeo una actitud positiva, la cual\n\nutilizo en todos los ámbitos de mi vida, me gusta capacitarme en\ndiversos temas, se trabajar bajo\npresión y en equipo, así como también tomar el liderazgo,\n\nrespetando siempre los\nlineamientos de la empresa, y cumpliendo sus requerimientos.",
  "Experience": "Rufi\nChief Technology Officer\njunio de 2017 - Present (7 años 9 meses)\n\nVeracruz y alrededores, México\n\n\nSIDERT\nLeader of Information Technologies\nmarzo de 2017 - Present (8 años)\nVeracruz y alrededores, México\n\n\nId Store & What's On\nChief Executive Officer\njulio de 2014 - julio de 2017 (3 años 1 mes)\nVeracruz y alrededores, México\n\nFue mi segundo y tercer negocio respectivamente, empecé ofreciendo los\nservicios de credencialización a escuelas, en el cual me encargaba del\nproceso completo, (elaboración, supervisión así como del mantenimiento\npreventivo y correctivo a los equipos de impresión). ID STORE es un negocio\nque normalmente realizo por temporadas en algunas escuelas y/o negocios,\nahora también manejo material publicitario impreso y digital, lo que originó la\ncreación de la Revista What’s On “La Primer Revista con Realidad Aumentada\nen Veracruz” en la cual soy el CEO y Editor, por lo cual afianzó mi trato con\nclientes mas complejos y amplió mi visión del marketing.\n\nICCAAT\nInformation Technology Specialist\njulio de 2016 - diciembre de 2016 (6 meses)\nVeracruz y alrededores, México\n\nDesarrollé tareas varias al estar como encargado de sistemas: instalación\nde sus programas (automotrices), mantenimiento preventivo y correctivo\nde equipos de cómputo e impresoras, edición de imágenes y de video,\nadministración y planeación de estrategias para aumentar la visibilidad en sus\nredes sociales.\n\n\nInstituto Tecnológico De Veracruz\nPracticante\nenero de 2015 - junio de 2015 (6 meses)\nVeracruz y alrededores, México\n\n✓ Elaboré un material didáctico acerca de las bases de datos.\n✓ Impartí cursos a algunos profesores acerca de los MOOC y sus plataformas\nweb\n✓ Elaboración de videos utilizando la técnica de Croma Key\n✓ Utilización de los software de edición de video.\n\n\nTenarisTamsa\nProfesor en Club de Verano\n2015 - 2015 (menos de un año)\nVeracruz y alrededores, México\n\nImpartí la clase de programación llamada “Coding”, en la cual les enseñe a los\nalumnos el lenguaje de JAVA, implementando el modo gráfico y programación\npor código a nivel básico, dependiendo de la edad de los grupos. Estructuré y\ndesarrollé mi material de trabajo por completo.\n\n\nNutri-Jugo\nSocio gerente\njulio de 2012 - julio de 2013 (1 año 1 mes)\nVeracruz y alrededores, México\n\nFue mi primer negocio, el cual desarrollé con un socio mas, y donde aprendí\nvarias cosas, como la atención al cliente, manejo de inventario, control de\ngastos, estrategias de venta, y actitud de servicio.",
  "Education": [
    {
      "Institution": "ISDI",
      "Start": "2017",
      "End": "2018",
      "Degree": "Page 2 of 3 Master Internet Business, Empresa, gestión, marketing y disciplinas afines"
    },
    {
      "Institution": "Instituto Tecnológico Autónomo de México",
      "Start": "02-2021",
      "End": "08-2021",
      "Degree": "Diplomatura, Desarrollo gerencial"
    },
    {
      "Institution": "Instituto Tecnológico de Veracruz",
      "Start": "2010",
      "End": "2015",
      "Degree": "Ingeniería, Ingenieria en Sistemas Computacionales"
    }
  ],
  "Contact": [
    "www.linkedin.com/in/victormag10(LinkedIn)"
  ],
  "Top Skills": [
    "Java",
    "MySQL",
    "PostgreSQL"
  ],
  "Languages": [
    {
      "Language": "Español"
    }
  ],
  "Certifications": [
    "Curso de Planificación de Proyectos",
    "Audiocurso Fundamentos de Product Management",
    "Curso de Fundamentos de Project Management",
    "Diplomado en Desarrollo Gerencial",
    "Curso Práctico de Project Management"
  ]
}